yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152m8.h
#define MASK_TIM5_CR2_CCDS       0x08
#define MASK_TIM5_CR2_MMS        0x70
#define MASK_TIM5_CR2_TI1S       0x80

#define MASK_TIM5_SMCR_SMS       0x07
#define MASK_TIM5_SMCR_TS        0x70
#define MASK_TIM5_SMCR_MSM       0x80

#define MASK_TIM5_ETR_ETF        0x0F
#define MASK_TIM5_ETR_ETPS       0x30
#define MASK_TIM5_ETR_ECE        0x40
#define MASK_TIM5_ETR_ETP        0x80

#define MASK_TIM5_DER_UDE        0x01
#define MASK_TIM5_DER_CC1DE      0x02
#define MASK_TIM5_DER_CC2DE      0x04

#define MASK_TIM5_IER_UIE        0x01
#define MASK_TIM5_IER_CC1IE      0x02
#define MASK_TIM5_IER_CC2IE      0x04
#define MASK_TIM5_IER_TIE        0x40
#define MASK_TIM5_IER_BIE        0x80

#define MASK_TIM5_SR1_UIF        0x01
#define MASK_TIM5_SR1_CC1IF      0x02
#define MASK_TIM5_SR1_CC2IF      0x04
#define MASK_TIM5_SR1_TIF        0x40
#define MASK_TIM5_SR1_BIF        0x80

#define MASK_TIM5_SR2_CC1OF      0x02
#define MASK_TIM5_SR2_CC2OF      0x04

#define MASK_TIM5_EGR_UG         0x01
#define MASK_TIM5_EGR_CC1G       0x02
#define MASK_TIM5_EGR_CC2G       0x04
#define MASK_TIM5_EGR_TG         0x40
#define MASK_TIM5_EGR_BG         0x80

#define MASK_TIM5_CCMR1_CC1S     0x03
#define MASK_TIM5_CCMR1_OC1FE    0x04
#define MASK_TIM5_CCMR1_OC1PE    0x08
#define MASK_TIM5_CCMR1_OC1M     0x70

#define MASK_TIM5_CCMR2_CC2S     0x03
#define MASK_TIM5_CCMR2_OC2FE    0x04
#define MASK_TIM5_CCMR2_OC2PE    0x08
#define MASK_TIM5_CCMR2_OC2M     0x70

#define MASK_TIM5_CCER1_CC1E     0x01
#define MASK_TIM5_CCER1_CC1P     0x02
#define MASK_TIM5_CCER1_CC2E     0x10
#define MASK_TIM5_CCER1_CC2P     0x20

#define MASK_TIM5_CNTRH_CNT8     0x01
#define MASK_TIM5_CNTRH_CNT9     0x02
#define MASK_TIM5_CNTRH_CNT10    0x04
#define MASK_TIM5_CNTRH_CNT11    0x08
#define MASK_TIM5_CNTRH_CNT12    0x10
#define MASK_TIM5_CNTRH_CNT13    0x20
#define MASK_TIM5_CNTRH_CNT14    0x40
#define MASK_TIM5_CNTRH_CNT15    0x80

#define MASK_TIM5_CNTRL_CNT0     0x01
#define MASK_TIM5_CNTRL_CNT1     0x02
#define MASK_TIM5_CNTRL_CNT2     0x04
#define MASK_TIM5_CNTRL_CNT3     0x08
#define MASK_TIM5_CNTRL_CNT4     0x10
#define MASK_TIM5_CNTRL_CNT5     0x20
#define MASK_TIM5_CNTRL_CNT6     0x40
#define MASK_TIM5_CNTRL_CNT7     0x80

#define MASK_TIM5_PSCR_PSC       0x07

#define MASK_TIM5_ARRH_ARR8      0x01
#define MASK_TIM5_ARRH_ARR9      0x02
#define MASK_TIM5_ARRH_ARR10     0x04
#define MASK_TIM5_ARRH_ARR11     0x08
#define MASK_TIM5_ARRH_ARR12     0x10
#define MASK_TIM5_ARRH_ARR13     0x20
#define MASK_TIM5_ARRH_ARR14     0x40
#define MASK_TIM5_ARRH_ARR15     0x80

#define MASK_TIM5_ARRL_ARR0      0x01
#define MASK_TIM5_ARRL_ARR1      0x02
#define MASK_TIM5_ARRL_ARR2      0x04
#define MASK_TIM5_ARRL_ARR3      0x08
#define MASK_TIM5_ARRL_ARR4      0x10
#define MASK_TIM5_ARRL_ARR5      0x20
#define MASK_TIM5_ARRL_ARR6      0x40
#define MASK_TIM5_ARRL_ARR7      0x80

#define MASK_TIM5_CCR1H_CCR18    0x01
#define MASK_TIM5_CCR1H_CCR19    0x02
#define MASK_TIM5_CCR1H_CCR110   0x04
#define MASK_TIM5_CCR1H_CCR111   0x08
#define MASK_TIM5_CCR1H_CCR112   0x10
#define MASK_TIM5_CCR1H_CCR113   0x20
#define MASK_TIM5_CCR1H_CCR114   0x40
#define MASK_TIM5_CCR1H_CCR115   0x80

#define MASK_TIM5_CCR1L_CCR10    0x01
#define MASK_TIM5_CCR1L_CCR11    0x02
#define MASK_TIM5_CCR1L_CCR12    0x04
#define MASK_TIM5_CCR1L_CCR13    0x08
#define MASK_TIM5_CCR1L_CCR14    0x10
#define MASK_TIM5_CCR1L_CCR15    0x20
#define MASK_TIM5_CCR1L_CCR16    0x40
#define MASK_TIM5_CCR1L_CCR17    0x80

#define MASK_TIM5_CCR2H_CCR28    0x01
#define MASK_TIM5_CCR2H_CCR29    0x02
#define MASK_TIM5_CCR2H_CCR210   0x04
#define MASK_TIM5_CCR2H_CCR211   0x08
#define MASK_TIM5_CCR2H_CCR212   0x10
#define MASK_TIM5_CCR2H_CCR213   0x20
#define MASK_TIM5_CCR2H_CCR214   0x40
#define MASK_TIM5_CCR2H_CCR215   0x80

#define MASK_TIM5_CCR2L_CCR10    0x01
#define MASK_TIM5_CCR2L_CCR11    0x02
#define MASK_TIM5_CCR2L_CCR12    0x04
#define MASK_TIM5_CCR2L_CCR13    0x08
#define MASK_TIM5_CCR2L_CCR14    0x10
#define MASK_TIM5_CCR2L_CCR15    0x20
#define MASK_TIM5_CCR2L_CCR16    0x40
#define MASK_TIM5_CCR2L_CCR17    0x80

#define MASK_TIM5_BKR_LOCK       0x03
#define MASK_TIM5_BKR_OSSI       0x04
#define MASK_TIM5_BKR_BKE        0x10
#define MASK_TIM5_BKR_BKP        0x20
#define MASK_TIM5_BKR_AOE        0x40
#define MASK_TIM5_BKR_MOE        0x80

#define MASK_TIM5_OISR_OIS1      0x01
#define MASK_TIM5_OISR_OIS2      0x04


/*-------------------------------------------------------------------------
 *      ADC1 register definitions
 *-----------------------------------------------------------------------*/
/* ADC1 configuration register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADON        : 1;
  unsigned char START       : 1;
  unsigned char CONT        : 1;
  unsigned char EOCIE       : 1;
  unsigned char AWDIE       : 1;
  unsigned char RES         : 2;
  unsigned char OVERIE      : 1;
} __BITS_ADC1_CR1;
#endif
__IO_REG8_BIT(ADC1_CR1,    0x5340, __READ_WRITE, __BITS_ADC1_CR1);

/* ADC1 configuration register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMTP1       : 3;
  unsigned char EXTSEL0     : 1;
  unsigned char EXTSEL1     : 1;
  unsigned char TRIG_EDGE0  : 1;
  unsigned char TRIG_EDGE1  : 1;
  unsigned char PRESC       : 1;
} __BITS_ADC1_CR2;
#endif
__IO_REG8_BIT(ADC1_CR2,    0x5341, __READ_WRITE, __BITS_ADC1_CR2);

/* ADC1 configuration register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CHSEL       : 5;
  unsigned char SMTP2       : 3;
} __BITS_ADC1_CR3;
#endif
__IO_REG8_BIT(ADC1_CR3,    0x5342, __READ_WRITE, __BITS_ADC1_CR3);

/* ADC1 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EOC         : 1;
  unsigned char AWD         : 1;
  unsigned char OVER        : 1;
} __BITS_ADC1_SR;
#endif
__IO_REG8_BIT(ADC1_SR,     0x5343, __READ_WRITE, __BITS_ADC1_SR);

/* ADC1 data register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CONV_DATA8  : 1;
  unsigned char CONV_DATA9  : 1;
  unsigned char CONV_DATA10 : 1;
  unsigned char CONV_DATA11 : 1;
} __BITS_ADC1_DRH;
#endif
__IO_REG8_BIT(ADC1_DRH,    0x5344, __READ, __BITS_ADC1_DRH);

