yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l152m8.h
/* LCD display memory 11 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S304        : 1;
  unsigned char S305        : 1;
  unsigned char S306        : 1;
  unsigned char S307        : 1;
  unsigned char S308        : 1;
  unsigned char S309        : 1;
  unsigned char S310        : 1;
  unsigned char S311        : 1;
} __BITS_LCD_RAM11;
#endif
__IO_REG8_BIT(LCD_RAM11,   0x5417, __READ_WRITE, __BITS_LCD_RAM11);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S312        : 1;
  unsigned char S313        : 1;
  unsigned char S314        : 1;
  unsigned char S315        : 1;
  unsigned char S316        : 1;
  unsigned char S317        : 1;
  unsigned char S318        : 1;
  unsigned char S319        : 1;
} __BITS_LCD_RAM12;
#endif
__IO_REG8_BIT(LCD_RAM12,   0x5418, __READ_WRITE, __BITS_LCD_RAM12);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S320        : 1;
  unsigned char S321        : 1;
  unsigned char S322        : 1;
  unsigned char S323        : 1;
  unsigned char S324        : 1;
  unsigned char S305        : 1;
  unsigned char S306        : 1;
  unsigned char S327        : 1;
} __BITS_LCD_RAM13;
#endif
__IO_REG8_BIT(LCD_RAM13,   0x5419, __READ_WRITE, __BITS_LCD_RAM13);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S028        : 1;
  unsigned char S029        : 1;
  unsigned char S030        : 1;
  unsigned char S031        : 1;
  unsigned char S032        : 1;
  unsigned char S033        : 1;
  unsigned char S034        : 1;
  unsigned char S035        : 1;
} __BITS_LCD_RAM14;
#endif
__IO_REG8_BIT(LCD_RAM14,   0x541A, __READ_WRITE, __BITS_LCD_RAM14);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S036        : 1;
  unsigned char S037        : 1;
  unsigned char S038        : 1;
  unsigned char S039        : 1;
  unsigned char S040        : 1;
  unsigned char S041        : 1;
  unsigned char S042        : 1;
  unsigned char S043        : 1;
} __BITS_LCD_RAM15;
#endif
__IO_REG8_BIT(LCD_RAM15,   0x541B, __READ_WRITE, __BITS_LCD_RAM15);

/* LCD display memory 11 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S128        : 1;
  unsigned char S129        : 1;
  unsigned char S130        : 1;
  unsigned char S131        : 1;
  unsigned char S132        : 1;
  unsigned char S133        : 1;
  unsigned char S134        : 1;
  unsigned char S135        : 1;
} __BITS_LCD_RAM16;
#endif
__IO_REG8_BIT(LCD_RAM16,   0x541C, __READ_WRITE, __BITS_LCD_RAM16);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S136        : 1;
  unsigned char S137        : 1;
  unsigned char S138        : 1;
  unsigned char S139        : 1;
  unsigned char S140        : 1;
  unsigned char S141        : 1;
  unsigned char S142        : 1;
  unsigned char S143        : 1;
} __BITS_LCD_RAM17;
#endif
__IO_REG8_BIT(LCD_RAM17,   0x541D, __READ_WRITE, __BITS_LCD_RAM17);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S228        : 1;
  unsigned char S229        : 1;
  unsigned char S230        : 1;
  unsigned char S231        : 1;
  unsigned char S232        : 1;
  unsigned char S233        : 1;
  unsigned char S234        : 1;
  unsigned char S235        : 1;
} __BITS_LCD_RAM18;
#endif
__IO_REG8_BIT(LCD_RAM18,   0x541E, __READ_WRITE, __BITS_LCD_RAM18);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S236        : 1;
  unsigned char S237        : 1;
  unsigned char S238        : 1;
  unsigned char S239        : 1;
  unsigned char S240        : 1;
  unsigned char S241        : 1;
  unsigned char S242        : 1;
  unsigned char S243        : 1;
} __BITS_LCD_RAM19;
#endif
__IO_REG8_BIT(LCD_RAM19,   0x541F, __READ_WRITE, __BITS_LCD_RAM19);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S328        : 1;
  unsigned char S329        : 1;
  unsigned char S330        : 1;
  unsigned char S331        : 1;
  unsigned char S332        : 1;
  unsigned char S333        : 1;
  unsigned char S334        : 1;
  unsigned char S335        : 1;
} __BITS_LCD_RAM20;
#endif
__IO_REG8_BIT(LCD_RAM20,   0x5420, __READ_WRITE, __BITS_LCD_RAM20);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S336        : 1;
  unsigned char S337        : 1;
  unsigned char S338        : 1;
  unsigned char S339        : 1;
  unsigned char S340        : 1;
  unsigned char S341        : 1;
  unsigned char S342        : 1;
  unsigned char S343        : 1;
} __BITS_LCD_RAM21;
#endif
__IO_REG8_BIT(LCD_RAM21,   0x5421, __READ_WRITE, __BITS_LCD_RAM21);


/*-------------------------------------------------------------------------
 *      LCD bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define LCD_CR1_B2               LCD_CR1_bit.B2
#define LCD_CR1_DUTY0            LCD_CR1_bit.DUTY0
#define LCD_CR1_DUTY1            LCD_CR1_bit.DUTY1
#define LCD_CR1_BLINKF0          LCD_CR1_bit.BLINKF0
#define LCD_CR1_BLINKF1          LCD_CR1_bit.BLINKF1
#define LCD_CR1_BLINKF2          LCD_CR1_bit.BLINKF2
#define LCD_CR1_BLINK0           LCD_CR1_bit.BLINK0
#define LCD_CR1_BLINK1           LCD_CR1_bit.BLINK1

#define LCD_CR2_VSEL             LCD_CR2_bit.VSEL
#define LCD_CR2_CC0              LCD_CR2_bit.CC0
#define LCD_CR2_CC1              LCD_CR2_bit.CC1
#define LCD_CR2_CC2              LCD_CR2_bit.CC2
#define LCD_CR2_HD               LCD_CR2_bit.HD
#define LCD_CR2_PON0             LCD_CR2_bit.PON0
#define LCD_CR2_PON1             LCD_CR2_bit.PON1
#define LCD_CR2_PON2             LCD_CR2_bit.PON2

#define LCD_CR3_DEAD0            LCD_CR3_bit.DEAD0
#define LCD_CR3_DEAD1            LCD_CR3_bit.DEAD1
#define LCD_CR3_DEAD2            LCD_CR3_bit.DEAD2
#define LCD_CR3_SOFC             LCD_CR3_bit.SOFC
#define LCD_CR3_SOF              LCD_CR3_bit.SOF
#define LCD_CR3_SOFIE            LCD_CR3_bit.SOFIE
#define LCD_CR3_LCDEN            LCD_CR3_bit.LCDEN

#define LCD_FRQ_DIV0             LCD_FRQ_bit.DIV0
#define LCD_FRQ_DIV1             LCD_FRQ_bit.DIV1
#define LCD_FRQ_DIV2             LCD_FRQ_bit.DIV2
#define LCD_FRQ_DIV3             LCD_FRQ_bit.DIV3
#define LCD_FRQ_PS0              LCD_FRQ_bit.PS0
#define LCD_FRQ_PS1              LCD_FRQ_bit.PS1
#define LCD_FRQ_PS2              LCD_FRQ_bit.PS2
#define LCD_FRQ_PS3              LCD_FRQ_bit.PS3

